app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 24]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 5], ["id", 12345]]
---
  def show
    if params[:artist_id]
      @ artist = Artist.find(params[:artist_id])
      @song = @artist.songs.find(params[:id])

SELECT "artists".* FROM "artists"
---
  def new
    #@song = Song.new
    if params[:artist_id] && !Artist.exists?(params[:artist_id])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]
---
  def edit
    #@song = Song.find(params[:id])

    if params[:artist_id]
      artist = Artist.find_by(id: params[:artist_id])
      if artist.nil?
        redirect_to artist_path, alert: "Artist not found."
      else
        @song = artist.songs.find_by(id: params[:id])